In [1]:
import pandas as pd

In [2]:
set1 = pd.read_csv("Data/val1.csv")

In [3]:
set2 = pd.read_csv("Data/val2.csv")

In [4]:
set3 = pd.read_csv('Data/val3.csv')

In [5]:
set2.head()

   Date  2021  2022  2023
0  val2   345   678   901

In [6]:
set1.head()

   Date  2021  2022  2023
0  val1   123   456   789

In [7]:
# set1.Name = set1

In [8]:
# set2.Name =set2

In [9]:
merged_df = pd.concat([set1, set2], ignore_index=False)

In [10]:
print(merged_df)

   Date  2021  2022  2023
0  val1   123   456   789
0  val2   345   678   901

In [11]:
merged_df = pd.concat([set1, set2, set3], ignore_index=False)

In [12]:
print(merged_df)

   Date  2021   2022  2023
0  val1   123  456.0   789
0  val2   345  678.0   901
0  val3   222    NaN   333

In [13]:
merged_df.head()

   Date  2021   2022  2023
0  val1   123  456.0   789
0  val2   345  678.0   901
0  val3   222    NaN   333